# 컴파일러 방식 :소스코드 작성 후 일괄적으로 기계어로 번역 후 실행.
# 소스코드를 기계어로 변환하는 과정 : 컴파일
# 소스코드를 기계어롤 변환하는 프로그램 : 컴파일러
# 수정사항 발생시 다시 전체 소스코드를 컴파일해야 함.

# 인터프리터 방식 : 소스코드 작성후 코드를 한줄씩 읽고 기계어로 변환후 실행
# 별도로 실행파일이 생성되지는 않음.
# 코드를 한 줄씩 읽고  기계어로 변환하는 프로그램 : 인터프리터

# 하이브리드 방식 : 컴파일 + 인터프리터 방식 혼용
# 즉, 소스코드를 번역해서 중간코드 생성
# 중간코드는 인터프리터방식으로 한 줄씩 읽어 코드 실행.
# 플랫폼에 독립적인 프로그램을 실행할 수 있음.

print('hello world')

#print에서 쓸 수 있는 형식 지정자.
# %d
# %f
# %c 문자 한 자
# %s 문자열

print('%d + %d 은 %d입니다.'% (100,100,100+100))

print('%d' % 1234567890)
print('%3d' % 1234567890)
print('%03d' % 1234567890)
print('%50d' % 1234567890)
print('%015d' % 1234567890)

print('\n줄바꿈\n연습\n')
print('\t줄바꿈\t연습\t')

str = """
안녕
안녕
"""
print(str)

5 / 3
5 // 3

